#lang racket

(define tech-channel-hash
  (hash
    "可编程逻辑" 7
    "MEMS/传感技术" 2
    "嵌入式系统" 6
    "模拟/电源" 1
    "射频/微波" 3
    "测试测量" 4
    "控制器/处理器" 5
    "EDA/PCB" 8
    "基础器件"9))

(define industry-channel-hash
  (hash
    "医疗电子" 12
    "汽车电子" 11
    "消费电子" 13
    "工业电子" 14
    "通信/网络" 10))

(define categories-hash 
  (hash
    "20" "设备"
    "21" "材料"
    "22" "芯片设计"
    "23" "电子元件"
    "24" "EDA工具"
    "24" "EDA工具"
    "25" "模拟电路"
    "26" "微处理器"
    ; "Logic_IC" "逻辑IC"
    "28" "存储器"
    "29" "传感器"
    "30" "分立器件"
    "31" "光学器件"
    "32" "晶圆制造"
    "33" "晶圆制造"
    "33" "晶圆制造"
    "34" "封装测试"
    "35" "封装测试"
    "35" "尖端科技"
    "10" "物联网"
    "11" "智能汽车"
    "37" "5G"
    "38" "人工智能"
    "42" "移动终端"))

(provide categories-hash)